socialNetwork/wrk2/user-timeline-without-istio/COMMAND_24/72
Running 1m test @ http://localhost:31111/wrk2-api/post/compose
  2 threads and 2 connections
  Thread calibration: mean lat.: 293.868ms, rate sampling interval: 1057ms
  Thread calibration: mean lat.: 361.828ms, rate sampling interval: 1241ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    45.49ms   63.32ms 300.80ms   88.25%
    Req/Sec    49.86      2.11    55.00     81.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.93ms
 75.000%   42.27ms
 90.000%  122.11ms
 99.000%  300.80ms
 99.900%  358.91ms
 99.990%  370.17ms
 99.999%  371.97ms
100.000%  371.97ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.631     0.000000            1         1.00
      13.007     0.100000          510         1.11
      14.143     0.200000         1005         1.25
      15.207     0.300000         1509         1.43
      16.175     0.400000         2016         1.67
      16.927     0.500000         2516         2.00
      17.359     0.550000         2768         2.22
      18.063     0.600000         3018         2.50
      19.663     0.650000         3265         2.86
      28.783     0.700000         3515         3.33
      42.271     0.750000         3766         4.00
      50.943     0.775000         3893         4.44
      59.615     0.800000         4017         5.00
      74.175     0.825000         4144         5.71
      88.319     0.850000         4268         6.67
     104.063     0.875000         4394         8.00
     112.895     0.887500         4457         8.89
     122.111     0.900000         4519        10.00
     135.039     0.912500         4582        11.43
     153.343     0.925000         4645        13.33
     180.863     0.937500         4708        16.00
     193.535     0.943750         4740        17.78
     206.207     0.950000         4771        20.00
     217.983     0.956250         4802        22.86
     229.759     0.962500         4833        26.67
     243.071     0.968750         4866        32.00
     248.191     0.971875         4880        35.56
     259.583     0.975000         4896        40.00
     267.263     0.978125         4912        45.71
     275.711     0.981250         4927        53.33
     285.183     0.984375         4943        64.00
     290.303     0.985938         4951        71.11
     294.655     0.987500         4959        80.00
     299.263     0.989062         4967        91.43
     301.055     0.990625         4974       106.67
     307.711     0.992188         4982       128.00
     314.367     0.992969         4986       142.22
     318.719     0.993750         4991       160.00
     322.815     0.994531         4995       182.86
     329.471     0.995313         4998       213.33
     337.919     0.996094         5002       256.00
     341.247     0.996484         5004       284.44
     344.831     0.996875         5006       320.00
     347.647     0.997266         5008       365.71
     348.415     0.997656         5011       426.67
     350.207     0.998047         5012       512.00
     351.743     0.998242         5013       568.89
     352.511     0.998437         5014       640.00
     353.279     0.998633         5015       731.43
     358.911     0.998828         5016       853.33
     360.447     0.999023         5018      1024.00
     360.447     0.999121         5018      1137.78
     360.447     0.999219         5018      1280.00
     360.447     0.999316         5018      1462.86
     360.959     0.999414         5019      1706.67
     360.959     0.999512         5019      2048.00
     360.959     0.999561         5019      2275.56
     370.175     0.999609         5020      2560.00
     370.175     0.999658         5020      2925.71
     370.175     0.999707         5020      3413.33
     370.175     0.999756         5020      4096.00
     370.175     0.999780         5020      4551.11
     371.967     0.999805         5021      5120.00
     371.967     1.000000         5021          inf
#[Mean    =       45.488, StdDeviation   =       63.324]
#[Max     =      371.712, Total count    =         5021]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5998 requests in 1.00m, 1.23MB read
Requests/sec:     99.96
Transfer/sec:     20.99KB